In [1]:
import pandas as pd
import tkinter as tk
from datetime import datetime
from pandastable import Table, TableModel
from tkinter import scrolledtext
import serial
import time

In [2]:
studentRecord = pd.read_csv("Class Lists.csv")
electronics = pd.read_csv('PowerElectronics.csv')
control = pd.read_csv('ControlSystem.csv')
system = pd.read_csv('PowerSystem.csv')

In [3]:
def create_new_column(df):

    dtt = datetime.now().strftime("%d %b, %a")
    prevName = df.columns[-1]
    if (prevName == 'NAME'):
        df[f'L-1 {datetime.now().strftime("%d %b, %a")}'] = 0
        return f'L-1 {datetime.now().strftime("%d %b, %a")}'

    newColName = f"L-{int(prevName.replace('-',' ').split()[1])+1} {dtt}" 
    df[newColName] = 0  
    return str(newColName)

In [4]:
def add_value_to_column_sid_wise(df, column_name, sid_value, value_to_add):
   
    if column_name not in df.columns:
        print("Column does not exist.")
        return
    df.loc[df['SID'] == sid_value, column_name] = value_to_add
    print(f'ADDED ATTENDACE FOR SID {sid_value}')
    print(df)
    return

In [5]:
electronics.index[electronics['SID'] ==21104002]

Index([1], dtype='int64')

In [6]:
std = 'Naheed'
sid = 21104002

naam = create_new_column(control)
control

         SID        NAME  L-1 07 Dec, Thu  L-2 10 Dec, Sun
0   21104001     Kashyap                0                0
1   21104002      Naheed                0                0
2   21104003     Abhinav                0                0
3   21104004    Siddhant                0                0
4   21104005    Aakshita                0                0
5   21104006       Aryan                0                0
6   21104007       Sneha                0                0
7   21104008       Samit                0                0
8   21104010     Rasneet                0                0
9   21104011       Amiti                0                0
10  21104012       Sumit                0                0
11  21104013  Deepankshu                0                0
12  21104015       Dolfy                0                0
13  21104016      Gurvir                0                0
14  21104017      Shiven                0                0
15  21104019       Sahil                0                0

In [7]:
add_value_to_column_sid_wise(df=control, column_name='L-1 07 Dec, Thu', sid_value=str(21104003), value_to_add=10)
control

ADDED ATTENDACE FOR SID 21104003
         SID        NAME  L-1 07 Dec, Thu  L-2 10 Dec, Sun
0   21104001     Kashyap                0                0
1   21104002      Naheed                0                0
2   21104003     Abhinav                0                0
3   21104004    Siddhant                0                0
4   21104005    Aakshita                0                0
5   21104006       Aryan                0                0
6   21104007       Sneha                0                0
7   21104008       Samit                0                0
8   21104010     Rasneet                0                0
9   21104011       Amiti                0                0
10  21104012       Sumit                0                0
11  21104013  Deepankshu                0                0
12  21104015       Dolfy                0                0
13  21104016      Gurvir                0                0
14  21104017      Shiven                0                0
15  21104019       Sahil                0                0

         SID        NAME  L-1 07 Dec, Thu  L-2 10 Dec, Sun
0   21104001     Kashyap                0                0
1   21104002      Naheed                0                0
2   21104003     Abhinav                0                0
3   21104004    Siddhant                0                0
4   21104005    Aakshita                0                0
5   21104006       Aryan                0                0
6   21104007       Sneha                0                0
7   21104008       Samit                0                0
8   21104010     Rasneet                0                0
9   21104011       Amiti                0                0
10  21104012       Sumit                0                0
11  21104013  Deepankshu                0                0
12  21104015       Dolfy                0                0
13  21104016      Gurvir                0                0
14  21104017      Shiven                0                0
15  21104019       Sahil                0                0

In [8]:
electronics

         SID        NAME  L-1 07 Dec, Thu  L-2 10 Dec, Sun
0   21104001     Kashyap                0                0
1   21104002      Naheed                0                0
2   21104003     Abhinav                0                0
3   21104004    Siddhant                0                0
4   21104005    Aakshita                0                0
5   21104006       Aryan                0                0
6   21104007       Sneha                0                0
7   21104008       Samit                0                0
8   21104010     Rasneet                0                0
9   21104011       Amiti                0                0
10  21104012       Sumit                0                0
11  21104013  Deepankshu                0                0
12  21104015       Dolfy                0                0
13  21104016      Gurvir                0                0
14  21104017      Shiven                0                0
15  21104019       Sahil                0                0

In [9]:
control

         SID        NAME  L-1 07 Dec, Thu  L-2 10 Dec, Sun
0   21104001     Kashyap                0                0
1   21104002      Naheed                0                0
2   21104003     Abhinav                0                0
3   21104004    Siddhant                0                0
4   21104005    Aakshita                0                0
5   21104006       Aryan                0                0
6   21104007       Sneha                0                0
7   21104008       Samit                0                0
8   21104010     Rasneet                0                0
9   21104011       Amiti                0                0
10  21104012       Sumit                0                0
11  21104013  Deepankshu                0                0
12  21104015       Dolfy                0                0
13  21104016      Gurvir                0                0
14  21104017      Shiven                0                0
15  21104019       Sahil                0                0